# 다음 문제를 풀이하시오

### Q1. "class_scores.csv" 파일을 Pandas 라이브러리를 활용하여 불러온 후 df 객체에 저장하시오.

In [1]:
import pandas as pd
df = pd.read_csv("../dataset/class_scores.csv")

### Q2. 성별에 따른 수학 점수의 차이를 확인하기 위해 독립 2표본 t검정을 실시하고 그 결과를 확인하시오.

In [5]:
math_M = df.loc[df.gender == "M", "Math"]
math_F = df.loc[df.gender == "F", "Math"]

In [6]:
from scipy.stats import ttest_ind
stat, p = ttest_ind(math_F, math_M)
stat, p

(0.18877452544527282, 0.85033358544687)

### Q3. 1학년과 3학년의 영어 점수의 차이를 확인하기 위해 독립 2표본 t검정을 실시하고 그 결과를 확인하시오.

In [23]:
eng_1 = df.loc[df.grade == 1, "English"]
eng_3 = df.loc[df.grade == 3, "English"]
stat, p = ttest_ind(eng_1, eng_3)
stat, p

(-0.3449906010270166, 0.730283678006105)

### Q4. 2학년과 3학년 중 평균점수가 50점 이상인 학생들만 따로 뽑아서 과학 점수의 차이를 확인해보려 한다. 독립 2표본 t검정을 실시하고 그 결과를 확인하시오.

In [14]:
df

     Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
0     10101      1     A      M    55       84       50         40       59
1     10102      1     A      M    29       94       41         87       57
2     10103      1     A      F    28       80       68         41      100
3     10104      1     A      F    45       74       48         88       75
4     10105      1     A      F    28       69       57         91       66
..      ...    ...   ...    ...   ...      ...      ...        ...      ...
595   30536      3     E      M    96       95       79         38       78
596   30537      3     E      F    66       79       48         97       43
597   30538      3     E      M    56       95       71         29       36
598   30539      3     E      M    51       67       39         91       55
599   30540      3     E      M    76       29       80         91       66

[600 rows x 9 columns]

In [45]:
df["mean"] = df.iloc[:, 4:].mean(axis=1)
scn_2 = df.loc[(df.grade == 2) & (df["mean"] >= 50), "Science"]
scn_3 = df.loc[(df.grade == 3) & (df["mean"] >= 50), "Science"]
stat, p = ttest_ind(scn_2, scn_3)
stat, p

(-1.245211692463718, 0.21384411017656302)